{
    "timelineData": [
        {
            "year": "до 996 г.",
            "title": "Ранние эпохи и становление регионов",
            "type": "major",
            "description": "Территория современной Австрии формируется на перекрёстке кельтского, римского и германо‑славянского миров. До появления названия Ostarrîchi здесь складывались хозяйство, дороги и власть разных культур.",
            "details": [
                "Кельты (Норикум): горное дело (железо), торговля; союз племён, позднее клиентское царство Рима.",
                "Римская эпоха: провинция Noricum, дороги (в т.ч. через Альпы), форты Дунайского лимеса, романизация городов.",
                "Великие переселения: германцы, славяне и аваpы; смена этнической карты, упадок римских институтов.",
                "Раннее Средневековье: заселение баварцами; влияние Агилофингов, затем франкских Каролингов.",
                "Франкская «Восточная марка»: после разгрома аваp (VIII–IX вв.) Каролинги создают приграничную марку (предтеча будущего Ostmark)."
            ],
            "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Kelten_Austria.png/1920px-Kelten_Austria.png",
            "imgAlt": "Римские легионеры"
        },
        {
            "year": "996 г.",
            "title": "Рождение имени",
            "type": "major",
            "description": "Формируется идентичность и политическая субъектность региона. Первое упоминание названия Ostarrîchi («Восточное государство»), от которого произошло современное Österreich. Это была пограничная территория Священной Римской империи под властью династии Бабенбергов.",
            "details": [
                "Укрепление марки: освоение и защита восточной границы, строительство крепостей и заселение.",
                "Города и управление: зачатки городской автономии, монетная регалия, админ. институты.",
                "Церковное покровительство: монастыри и соборы (напр., Мельк) как центры культуры и земледелия.",
                "Дунайская торговля: развитие путей и рынков вдоль Дуная, рост ремёсел.",
                "Подъём Вены: перенос резиденции (1155) и превращение города в политико-экономический центр."
            ],
            "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Erzbischof_Konrad_von_Salzburg.JPG/320px-Erzbischof_Konrad_von_Salzburg.JPG",
            "imgAlt": "Остаррихи-уркунде (996)"
        },
        {
            "year": "1156 г.",
            "title": "Privilegium Minus – герцогство Австрия",
            "type": "major",
            "description": "Ключевой политико‑правовой шаг к самостоятельности восточной марки. Император Фридрих I Барбаросса возвёл Ostmark в <em>герцогство Австрия</em>, выделив её из Баварии и закрепив особые права Бабенбергов (в т.ч. по наследованию).",
            "details": [
                "Отдельный статус: собственные институты и династия → отличная от баварской/немецкой административная траектория.",
                "Языковая основа: австро‑баварские диалекты формируются в Средние века, усиливая региональную самобытность.",
                "Центры власти: рост Вены и Клостернойбурга как опорных пунктов будущей «австрийской» идентичности."
            ],
            "imgSrc": "https://images.steamusercontent.com/ugc/266095900581804672/FFAB5DCC975B79752CE5E1DCC6ED2A4BD98D76F3/?imw=512&&ima=fit&impolicy=Letterbox&imcolor=%23000000&letterbox=false",
            "imgAlt": "Герцог Австрии, 1156"           
        },
        {
            "year": "1278 г.",
            "title": "Эпоха Габсбургов",
            "type": "major",
            "description": "Австрия становится ядром одной из ведущих европейских держав. Начало правления династии Габсбургов, которое продлилось более 600 лет и определило судьбу Европы, превратив Австрию в центр могущественной империи.",
            "details": [
                "Дунайская торговля и транзит между севером и югом Европы",
                "Горнорудная база Богемии и Альп (серебро, железо, соль)",
                "Ремёсла и мануфактуры в многонациональных землях империи",
                "Финансы Вены и двора как центр капитала и спроса"
            ],
            "imgSrc": "https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_685c37983834b13f503329ef_685c379b52b1f4181a29d073/scale_1200",
            "imgAlt": "Герб дома Габсбургов"
        },
        {
            "year": "1365 г.",
            "title": "Основание Венского университета",
            "type": "minor",
            "description": "Важнейшим событием стало основание герцогом Рудольфом IV Венского университета. Это был не просто акт меценатства, а стратегически важный шаг. Для управления сложной и расширяющейся империей требовались высокообразованные юристы, чиновники и теологи. Пригласив профессоров из знаменитой парижской Сорбонны, Рудольф IV создал мощный интеллектуальный центр, способный готовить кадры для имперской администрации."
        },
        {
            "year": "1867 г.",
            "title": "Австро-Венгрия",
            "type": "major",
            "description": "Страна трансформируется в дуалистическую империю и сохраняет статус великой державы. После поражения от Пруссии империя реорганизована в дуалистическую монархию – Австро-Венгрию, сложное многонациональное государство, просуществовавшее до 1918 года.",
            "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Civil_ensign_of_Austria-Hungary_%281869-1918%29.svg/1200px-Civil_ensign_of_Austria-Hungary_%281869-1918%29.svg.png",
            "imgAlt": "Флаг Австро-Венгрии (1867–1918)"
        },
        {
            "year": "1918 г.",
            "title": "Первая Австрийская Республика",
            "type": "major",
            "description": "Рождение республики после распада Австро-Венгрии. Провозглашение республики в Вене, попытка самоопределения и поиск новой идентичности в границах «немецкой Австрии», тяжелый экономический и политический старт межвоенного периода.",
            "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Flag_of_Austria_%281230%E2%80%931934%29.svg/1200px-Flag_of_Austria_%281230%E2%80%931934%29.svg.png",
            "imgAlt": "Провозглашение республики, 1918"
        },
        {
            "year": "1919 г.",
            "title": "Независимость и международное признание",
            "type": "major",
            "description": "Международная фиксация суверенитета и границ. Сен-Жерменский мирный договор закрепил независимость Австрии, запретив объединение с Германией и определив новые границы и международно-правовой статус страны.",
            "imgSrc": "https://news.store.rambler.ru/img/f96e8a95057315a4ca4561a2bd9f2d0e?img-format=auto&img-1-resize=height:400,fit:max",
            "imgAlt": "Сен-Жерменский договор, 1919"
        },
        {
            "year": "1938 г.",
            "title": "Аншлюс",
            "type": "major",
            "description": "Утрата суверенитета и включение в нацистскую Германию. Аннексия Австрии нацистской Германией на фоне политической нестабильности и установления авторитарного режима в Первой Австрийской Республике (1918–1938).",
            "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Heldenplatz.jpg",
            "imgAlt": "Вена, Хельденплац, 1938"
        },
        {
            "year": "1945 г.",
            "title": "Восстановление независимости",
            "type": "major",
            "description": "Конец нацистскому правлению и провозглашение независимости. 27 апреля 1945 года Провизорическое правительство провозгласило восстановление независимости Австрии; начался период союзной оккупации и путь к Государственному договору 1955 года.",
            "imgSrc": "https://nwm.at/wp-content/uploads/2024/10/Karte_Alliierte_Besatzungszonen_in_Oesterreich_von_1945_bis_1955-1.jpg",
            "imgAlt": "Провозглашение независимости Австрии, 1945"
        },
        {
            "year": "1955 г.",
            "title": "Вторая Республика",
            "type": "major",
            "description": "Возвращение суверенитета и закрепление нейтралитета – новая роль в Европе. После 10 лет оккупации союзниками, подписание Государственного договора. Австрия вновь обретает суверенитет, провозглашает постоянный нейтралитет и создает современную демократическую Вторую Республику.",
            "imgSrc": "https://www.bpb.de/cache/images/7/309807_teaser_widh_800.jpg?4CD99",
            "imgAlt": "Подписание Государственного договора, 1955"
        }
    ]
}